Show / Hide Table of Contents
Class CutData
Provides data of the cut beam
Inheritance
System.Object
CutData
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
public class CutData
Properties
Improve this Doc   View Source
NormalVector
Plane normal
Declaration
public Vector3D NormalVector { get; set; }
Property Value
 Type |  Description
 Vector3D
Improve this Doc   View Source
PlanePoint
3DPlane Point
Declaration
public Point3D PlanePoint { get; set; }
Property Value
 Type |  Description
 Point3D
 Improve this Doc
 View Source